Revit 2024 API
StructuralAsset.SubClass Property
 The sub-class of the asset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public string SubClass { get; set; }
Visual Basic
Public Property SubClass As String
	Get
	Set
Visual C++
public:
property String^ SubClass {
	String^ get ();
	void set (String^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
StructuralAsset Class
Autodesk.Revit.DB Namespace